## Pandas Library

In [1]:
import pandas as pd

In [22]:
csv_path = "data/recidism.csv"

In [27]:
df_csv = pd.read_csv(csv_path)  # read csv file into data frame

In [28]:
df_csv.head()

,black,alcohol,drugs,super,married,felon,workprg,property,person,priors,educ,rules,age,tserved,follow,durat,cens,ldurat
0,0,1,0,1,1,0,1,0,0,0,7,2,441,30,72,72,1,4.276666
1,1,0,0,1,0,1,1,1,0,0,12,0,307,19,75,75,1,4.317488
2,0,0,0,0,0,0,1,1,0,0,9,5,262,27,81,9,0,2.197225
3,0,0,1,1,0,1,1,1,0,2,9,3,253,38,76,25,0,3.218876
4,0,0,1,1,0,0,0,0,0,0,9,0,244,4,81,81,1,4.394449

In [33]:
xlsx_path = "data/deneme.xlsx"

In [34]:
df_xlsx = pd.read_excel(xlsx_path)

In [35]:
df_xlsx.head()

,STATE CODE,COUNTY CODE,COUNTY,GENDER CODE,GENDER,RACE CODE,RACE,AGE,2 DIGIT NAICS,INDUSTRY,EDUCATION CODE,EDUCATION,LOCAL AREA,MSA,PROJECTION REGION,PROGRAM
0,20,45,DOUGLAS,2,FEMALE,1,WHITE,68,62,HEALTH CARE AND SOCIAL ASSISTANCE,6,BACHELOR’S DEGREE,2,LAWRENCE MSA,NORTHEAST,REGULAR UI
1,20,173,SEDGWICK,1,MALE,1,WHITE,41,23,CONSTRUCTION,2,HIGH SCHOOL DIPLOMA / GED,4,WICHITA MSA,SOUTH CENTRAL,REGULAR UI
2,20,125,MONTGOMERY,1,MALE,1,WHITE,30,71,"ARTS, ENTERTAINMENT AND RECREATION",1,LESS THAN HIGH SCHOOL,5,BALANCE OF STATE,SOUTHEAST,REGULAR UI
3,20,103,LEAVENWORTH,1,MALE,3,ASIAN,56,56,ADMIN AND SUPPORT AND WASTE MGMT AND REMEDIATI...,6,BACHELOR’S DEGREE,3,KANSAS CITY KS MSA,KANSAS CITY,REGULAR UI
4,20,91,JOHNSON,1,MALE,1,WHITE,51,52,FINANCE AND INSURANCE,6,BACHELOR’S DEGREE,3,KANSAS CITY KS MSA,KANSAS CITY,REGULAR UI

In [40]:
## Convert dictionary to data frame

In [41]:
songs = {"Album": ["thriller", "back in black", "dark side of moon"],
        "released": [1982, 1980, 1973],
        "length": ["00:42:19", "00:42:11", "00:45:56"]}

songs_frame = pd.DataFrame(songs)

In [42]:
songs_frame.head()

               Album  released    length
0           thriller      1982  00:42:19
1      back in black      1980  00:42:11
2  dark side of moon      1973  00:45:56

### Subsetting Data frame

In [49]:
album = songs_frame[["Album"]]

album

               Album
0           thriller
1      back in black
2  dark side of moon

In [50]:
A2 = songs_frame[["Album", "length"]]

A2

               Album    length
0           thriller  00:42:19
1      back in black  00:42:11
2  dark side of moon  00:45:56

In [54]:
A2.iloc[1, 1]     ## location based subsetting

'00:42:11'

In [55]:
A2.iloc[0, 0]

'thriller'

In [57]:
A2.loc[0,"Album"]     ## label based subsetting

'thriller'

### Unique values

In [73]:
df_xlsx2 = df_xlsx[["AGE", "GENDER"]]

df_xlsx2.head()

   AGE  GENDER
0   68  FEMALE
1   41    MALE
2   30    MALE
3   56    MALE
4   51    MALE

In [72]:
df_xlsx["GENDER"].unique()

array(['FEMALE', 'MALE'], dtype=object)

### Subset rows and columns

In [74]:
df_xlsx2["AGE"] >= 50   ## boolean vector

0        True
1       False
2       False
3        True
4        True
5       False
6        True
7        True
8        True
9       False
10      False
11      False
12      False
13      False
14      False
15       True
16       True
17      False
18      False
19      False
20      False
21       True
22       True
23       True
24       True
25      False
26      False
27       True
28      False
29      False
        ...
9522    False
9523    False
9524    False
9525    False
9526    False
9527    False
9528     True
9529    False
9530    False
9531    False
9532    False
9533     True
9534    False
9535    False
9536    False
9537    False
9538    False
9539     True
9540    False
9541    False
9542    False
9543    False
9544    False
9545    False
9546    False
9547    False
9548    False
9549    False
9550    False
9551    False
Name: AGE, Length: 9552, dtype: bool

In [76]:
subset1 = df_xlsx2[df_xlsx2["AGE"] >= 50]  

subset1.head()

   AGE  GENDER
0   68  FEMALE
3   56    MALE
4   51    MALE
6   58    MALE
7   50  FEMALE

In [79]:
### saving as CSV

subset1.to_csv("data/subset1.csv")

In [80]:
df_xlsx2.head()

   AGE  GENDER
0   68  FEMALE
1   41    MALE
2   30    MALE
3   56    MALE
4   51    MALE

In [82]:
df_xlsx2.iloc[2, 1]

'MALE'

In [85]:
df_xlsx2.loc[2, "GENDER"]

'MALE'

In [86]:
df_xlsx2.iloc[2, "GENDER"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types